// services/pdfService.js
import axios from "axios";

export const getPDFs = () => axios.get(`${process.env.NEXT_PUBLIC_API_URL}/api/pdfFile`);

export const Notices = [
    { title: "২০২৫ শিক্ষাবর্ষে ৬ষ্ঠ, ৭ম ও ৯ম শ্রেণিতে শিক্ষার্থী ভর্তি বিজ্ঞপ্তি" },
    { title: "বার্ষিক কর্ম সম্পাদনা চুক্তি ২০২৩-২৪" },
    { title: "২০২৪ শিক্ষাবর্ষে ৬ষ্ঠ ও ৯ম শ্রেণিতে ভর্তি সংক্রান্ত" },
    { title: "৩য়, ৪র্থ, ৫ম, ৮ম ও ৯ম শ্রেণির বার্ষিক পরীক্ষা রুটিন" },

];

export const HistoryOfMGHS = [
    { title: "উনবিংশ শতাব্দীর সূচনালগ্নে ব্রিটিশ ভারতে ফোর্ট উইলিয়াম দুর্গকে ফোর্ট উইলিয়াম কলেজে রূপান্তরিত করার মধ্য দিয়ে আধুনিক শিক্ষার সূত্রপাত ঘটে। আধুনিক শিক্ষার আলোয় উদ্ভাসিত হওয়ার মহৎ বাসনা নিয়ে ভারতীয় উপমহাদেশের মানুষ জেগে ওঠে। শুরু হয় উপমহাদেশের বিভিন্ন স্থানে স্কুল-কলেজ প্রতিষ্ঠার কাজ। স্কুল-কলেজ প্রতিষ্ঠার এ ধারাবাহিকতায় বাংলাদেশে বৃহত্তর সিলেট অঞ্চলের বিভিন্ন শহরে ১৮৭০ সাল থেকে ১৯০০ সালের মধ্যে শিক্ষা প্রতিষ্ঠান নির্মিত হয়। মৌলভীবাজার সরকারি উচ্চ বিদ্যালয়টি এভাবেই প্রতিষ্ঠিত হয়। এরপর ১৯৮৫ সালে  গরফফষব ঊহমষরংয ঝপযড়ড়ষ এবং ১৮৯১ সালে তৎকালীন আসাম সরকার এ বিদ্যালয়কে সরকারি করণের আওতায় এনে সরকারি উচ্চ বিদ্যালয় নামে অভিহিত করে। কালের বিবর্তনে এটি মৌলভীবাজার সরকারি উচ্চ বিদ্যালয় নামে দেশব্যাপী পরিচিতি লাভ করে। এ বিদ্যালয়ে অধ্যয়ন করে বহু প্রতিভাবান শিক্ষার্থী যেমন স্বীয় জীবনকে ধন্য করেছেন, ঠিক তেমনি বিদ্যালয়ের সুমানকে চারিদিকে ছড়িয়ে দিয়েছেন। আন্তর্জাতিক খ্যাতিসম্পন্ন অর্থনীতিবিদ মরহুম এম সাইফুর রহমান ও মরহুম শাহ এ এম এস কিবরিয়া এ বিদ্যালয়ে অধ্যয়ন করে আমাদের গৌরব বৃদ্ধি করেছেন। রম্য রচনার শ্রেষ্ঠ সাহিত্যিক ও বহুভাষাবিদ পন্ডিত সৈয়দ মুজতবা আলী এ বিদ্যালয়ের ছাত্র হিসাবে আমাদেরকে বিমলানন্দে উদ্ভাসিত করেছেন।" },
    { title: "বিদ্যালয়ের অবস্থান: হযরত শাহ মোস্তফা(র: ) পূণ্যস্মৃতি বিজড়িত প্রাকৃতিক সৌন্দর্যের লীলাভূমি মৌলভীবাজার শহরের কেন্দ্রস্থলে সৈয়দ মুজতবা আলী সড়কের পূর্ব পাশে বিদ্যালয়টি অবস্থিত। বিদ্যালয়ের ব্যবহৃত ভূমি পরিমাণ ১১.৫৭ একর। বিদ্যালয়ে প্রবেশপথের দু’পাশে দু’টি দৃষ্টিনন্দন ফুলের বাগান প্রসাসনিক ভবনের সম্মুখ প্রাঙ্গন শোভামন্ডিত করে রেখেছে। পাঠদান ও আনুষাঙ্গিক কাজের জন্য ব্যবহৃত ২টি ত্রিতল ভবন ক্যাম্পাসের সৌন্দর্য বৃদ্ধি করেছে। তাছাড়া নির্মানাধীন বহুতল ভবনের কাজ সমাপ্ত হলে শ্রেণি কক্ষের সংখ্যা বৃদ্ধি পাবে এবং ক্যাম্পাসটি আরো দৃষ্টিনন্দন হয়ে উঠবে।" }
]
